ciaa/firmware_v1/externals/drivers/msp430/inc/msp430x54x.h
/* UCBxIFG Control Bits */
#define UCNACKIFG           (0x0020)  /* NAK Condition interrupt Flag */
#define UCALIFG             (0x0010)  /* Arbitration Lost interrupt Flag */
#define UCSTPIFG            (0x0008)  /* STOP Condition interrupt Flag */
#define UCSTTIFG            (0x0004)  /* START Condition interrupt Flag */
#define UCTXIFG             (0x0002)  /* USCI Transmit Interrupt Flag */
#define UCRXIFG             (0x0001)  /* USCI Receive Interrupt Flag */

/* USCI Definitions */
#define USCI_NONE           (0x0000)    /* No Interrupt pending */
#define USCI_UCRXIFG        (0x0002)    /* USCI UCRXIFG */
#define USCI_UCTXIFG        (0x0004)    /* USCI UCTXIFG */
#define USCI_I2C_UCALIFG    (0x0002)    /* USCI I2C Mode: UCALIFG */
#define USCI_I2C_UCNACKIFG  (0x0004)    /* USCI I2C Mode: UCNACKIFG */
#define USCI_I2C_UCSTTIFG   (0x0006)    /* USCI I2C Mode: UCSTTIFG*/
#define USCI_I2C_UCSTPIFG   (0x0008)    /* USCI I2C Mode: UCSTPIFG*/
#define USCI_I2C_UCRXIFG    (0x000A)    /* USCI I2C Mode: UCRXIFG */
#define USCI_I2C_UCTXIFG    (0x000C)    /* USCI I2C Mode: UCTXIFG */

/************************************************************
* USCI A1
************************************************************/
#define __MSP430_HAS_USCI_A1__       /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_A1__ 0x0600
#define USCI_A1_BASE __MSP430_BASEADDRESS_USCI_A1__

#define UCA1CTLW0_            0x0600    /* USCI A1 Control Word Register 0 */
sfrb(UCA1CTLW0_L , UCA1CTLW0_);
sfrb(UCA1CTLW0_H , UCA1CTLW0_+1);
sfrw(UCA1CTLW0, UCA1CTLW0_);
#define UCA1CTL1            UCA1CTLW0_L  /* USCI A1 Control Register 1 */
#define UCA1CTL0            UCA1CTLW0_H  /* USCI A1 Control Register 0 */
#define UCA1BRW_              0x0606    /* USCI A1 Baud Word Rate 0 */
sfrb(UCA1BRW_L , UCA1BRW_);
sfrb(UCA1BRW_H , UCA1BRW_+1);
sfrw(UCA1BRW, UCA1BRW_);
#define UCA1BR0             UCA1BRW_L /* USCI A1 Baud Rate 0 */
#define UCA1BR1             UCA1BRW_H /* USCI A1 Baud Rate 1 */
#define UCA1MCTL_             0x0608    /* USCI A1 Modulation Control */
sfrb(UCA1MCTL, UCA1MCTL_);
#define UCA1STAT_             0x060A    /* USCI A1 Status Register */
sfrb(UCA1STAT, UCA1STAT_);
#define UCA1RXBUF_            0x060C    /* USCI A1 Receive Buffer */
const_sfrb(UCA1RXBUF, UCA1RXBUF_);
#define UCA1TXBUF_            0x060E    /* USCI A1 Transmit Buffer */
sfrb(UCA1TXBUF, UCA1TXBUF_);
#define UCA1ABCTL_            0x0610    /* USCI A1 LIN Control */
sfrb(UCA1ABCTL, UCA1ABCTL_);
#define UCA1IRCTL_            0x0612    /* USCI A1 IrDA Transmit Control */
sfrb(UCA1IRCTL_L , UCA1IRCTL_);
sfrb(UCA1IRCTL_H , UCA1IRCTL_+1);
sfrw(UCA1IRCTL, UCA1IRCTL_);
#define UCA1IRTCTL          UCA1IRCTL_L  /* USCI A1 IrDA Transmit Control */
#define UCA1IRRCTL          UCA1IRCTL_H  /* USCI A1 IrDA Receive Control */
#define UCA1ICTL_             0x061C    /* USCI A1 Interrupt Enable Register */
sfrb(UCA1ICTL_L , UCA1ICTL_);
sfrb(UCA1ICTL_H , UCA1ICTL_+1);
sfrw(UCA1ICTL, UCA1ICTL_);
#define UCA1IE              UCA1ICTL_L  /* USCI A1 Interrupt Enable Register */
#define UCA1IFG             UCA1ICTL_H  /* USCI A1 Interrupt Flags Register */
#define UCA1IV_               0x061E    /* USCI A1 Interrupt Vector Register */
sfrw(UCA1IV, UCA1IV_);


/************************************************************
* USCI B1
************************************************************/
#define __MSP430_HAS_USCI_B1__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_B1__ 0x0620
#define USCI_B1_BASE __MSP430_BASEADDRESS_USCI_B1__


#define UCB1CTLW0_            0x0620    /* USCI B1 Control Word Register 0 */
sfrb(UCB1CTLW0_L , UCB1CTLW0_);
sfrb(UCB1CTLW0_H , UCB1CTLW0_+1);
sfrw(UCB1CTLW0, UCB1CTLW0_);
#define UCB1CTL1            UCB1CTLW0_L  /* USCI B1 Control Register 1 */
#define UCB1CTL0            UCB1CTLW0_H  /* USCI B1 Control Register 0 */
#define UCB1BRW_              0x0626    /* USCI B1 Baud Word Rate 0 */
sfrb(UCB1BRW_L , UCB1BRW_);
sfrb(UCB1BRW_H , UCB1BRW_+1);
sfrw(UCB1BRW, UCB1BRW_);
#define UCB1BR0             UCB1BRW_L /* USCI B1 Baud Rate 0 */
#define UCB1BR1             UCB1BRW_H /* USCI B1 Baud Rate 1 */
#define UCB1STAT_             0x062A    /* USCI B1 Status Register */
sfrb(UCB1STAT, UCB1STAT_);
#define UCB1RXBUF_            0x062C    /* USCI B1 Receive Buffer */
const_sfrb(UCB1RXBUF, UCB1RXBUF_);
#define UCB1TXBUF_            0x062E    /* USCI B1 Transmit Buffer */
sfrb(UCB1TXBUF, UCB1TXBUF_);
#define UCB1I2COA_            0x0630    /* USCI B1 I2C Own Address */
sfrb(UCB1I2COA_L , UCB1I2COA_);
sfrb(UCB1I2COA_H , UCB1I2COA_+1);
sfrw(UCB1I2COA, UCB1I2COA_);
#define UCB1I2CSA_            0x0632    /* USCI B1 I2C Slave Address */
sfrb(UCB1I2CSA_L , UCB1I2CSA_);
sfrb(UCB1I2CSA_H , UCB1I2CSA_+1);
sfrw(UCB1I2CSA, UCB1I2CSA_);
#define UCB1ICTL_             0x063C    /* USCI B1 Interrupt Enable Register */
sfrb(UCB1ICTL_L , UCB1ICTL_);
sfrb(UCB1ICTL_H , UCB1ICTL_+1);
sfrw(UCB1ICTL, UCB1ICTL_);
#define UCB1IE              UCB1ICTL_L  /* USCI B1 Interrupt Enable Register */
#define UCB1IFG             UCB1ICTL_H  /* USCI B1 Interrupt Flags Register */
#define UCB1IV_               0x063E    /* USCI B1 Interrupt Vector Register */
sfrw(UCB1IV, UCB1IV_);

/************************************************************
* USCI A2
************************************************************/
#define __MSP430_HAS_USCI_A2__       /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_A2__ 0x0640
#define USCI_A2_BASE __MSP430_BASEADDRESS_USCI_A2__

#define UCA2CTLW0_            0x0640    /* USCI A2 Control Word Register 0 */
sfrb(UCA2CTLW0_L , UCA2CTLW0_);
sfrb(UCA2CTLW0_H , UCA2CTLW0_+1);
sfrw(UCA2CTLW0, UCA2CTLW0_);
#define UCA2CTL1            UCA2CTLW0_L  /* USCI A2 Control Register 1 */
#define UCA2CTL0            UCA2CTLW0_H  /* USCI A2 Control Register 0 */
#define UCA2BRW_              0x0646    /* USCI A2 Baud Word Rate 0 */
sfrb(UCA2BRW_L , UCA2BRW_);
sfrb(UCA2BRW_H , UCA2BRW_+1);
sfrw(UCA2BRW, UCA2BRW_);
#define UCA2BR0             UCA2BRW_L /* USCI A2 Baud Rate 0 */
#define UCA2BR1             UCA2BRW_H /* USCI A2 Baud Rate 1 */
#define UCA2MCTL_             0x0648    /* USCI A2 Modulation Control */
sfrb(UCA2MCTL, UCA2MCTL_);
#define UCA2STAT_             0x064A    /* USCI A2 Status Register */
sfrb(UCA2STAT, UCA2STAT_);
#define UCA2RXBUF_            0x064C    /* USCI A2 Receive Buffer */
const_sfrb(UCA2RXBUF, UCA2RXBUF_);
#define UCA2TXBUF_            0x064E    /* USCI A2 Transmit Buffer */
sfrb(UCA2TXBUF, UCA2TXBUF_);
#define UCA2ABCTL_            0x0650    /* USCI A2 LIN Control */
sfrb(UCA2ABCTL, UCA2ABCTL_);
#define UCA2IRCTL_            0x0652    /* USCI A2 IrDA Transmit Control */
sfrb(UCA2IRCTL_L , UCA2IRCTL_);
sfrb(UCA2IRCTL_H , UCA2IRCTL_+1);
sfrw(UCA2IRCTL, UCA2IRCTL_);
#define UCA2IRTCTL          UCA2IRCTL_L  /* USCI A2 IrDA Transmit Control */
#define UCA2IRRCTL          UCA2IRCTL_H  /* USCI A2 IrDA Receive Control */
#define UCA2ICTL_             0x065C    /* USCI A2 Interrupt Enable Register */
sfrb(UCA2ICTL_L , UCA2ICTL_);
sfrb(UCA2ICTL_H , UCA2ICTL_+1);
sfrw(UCA2ICTL, UCA2ICTL_);
#define UCA2IE              UCA2ICTL_L  /* USCI A2 Interrupt Enable Register */
#define UCA2IFG             UCA2ICTL_H  /* USCI A2 Interrupt Flags Register */
#define UCA2IV_               0x065E    /* USCI A2 Interrupt Vector Register */
sfrw(UCA2IV, UCA2IV_);


/************************************************************
* USCI B2
************************************************************/
#define __MSP430_HAS_USCI_B2__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_B2__ 0x0660
#define USCI_B2_BASE __MSP430_BASEADDRESS_USCI_B2__


#define UCB2CTLW0_            0x0660    /* USCI B2 Control Word Register 0 */
sfrb(UCB2CTLW0_L , UCB2CTLW0_);
sfrb(UCB2CTLW0_H , UCB2CTLW0_+1);
sfrw(UCB2CTLW0, UCB2CTLW0_);
#define UCB2CTL1            UCB2CTLW0_L  /* USCI B2 Control Register 1 */
#define UCB2CTL0            UCB2CTLW0_H  /* USCI B2 Control Register 0 */
#define UCB2BRW_              0x0666    /* USCI B2 Baud Word Rate 0 */
sfrb(UCB2BRW_L , UCB2BRW_);
sfrb(UCB2BRW_H , UCB2BRW_+1);
sfrw(UCB2BRW, UCB2BRW_);
#define UCB2BR0             UCB2BRW_L /* USCI B2 Baud Rate 0 */
#define UCB2BR1             UCB2BRW_H /* USCI B2 Baud Rate 1 */
#define UCB2STAT_             0x066A    /* USCI B2 Status Register */
sfrb(UCB2STAT, UCB2STAT_);
#define UCB2RXBUF_            0x066C    /* USCI B2 Receive Buffer */
const_sfrb(UCB2RXBUF, UCB2RXBUF_);
#define UCB2TXBUF_            0x066E    /* USCI B2 Transmit Buffer */
sfrb(UCB2TXBUF, UCB2TXBUF_);
#define UCB2I2COA_            0x0670    /* USCI B2 I2C Own Address */
sfrb(UCB2I2COA_L , UCB2I2COA_);
sfrb(UCB2I2COA_H , UCB2I2COA_+1);
sfrw(UCB2I2COA, UCB2I2COA_);
#define UCB2I2CSA_            0x0672    /* USCI B2 I2C Slave Address */
sfrb(UCB2I2CSA_L , UCB2I2CSA_);
sfrb(UCB2I2CSA_H , UCB2I2CSA_+1);
sfrw(UCB2I2CSA, UCB2I2CSA_);
#define UCB2ICTL_             0x067C    /* USCI B2 Interrupt Enable Register */
sfrb(UCB2ICTL_L , UCB2ICTL_);
sfrb(UCB2ICTL_H , UCB2ICTL_+1);
sfrw(UCB2ICTL, UCB2ICTL_);
#define UCB2IE              UCB2ICTL_L  /* USCI B2 Interrupt Enable Register */
#define UCB2IFG             UCB2ICTL_H  /* USCI B2 Interrupt Flags Register */
#define UCB2IV_               0x067E    /* USCI B2 Interrupt Vector Register */
sfrw(UCB2IV, UCB2IV_);

/************************************************************
* USCI A3
************************************************************/
#define __MSP430_HAS_USCI_A3__       /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_A3__ 0x0680
#define USCI_A3_BASE __MSP430_BASEADDRESS_USCI_A3__

